# GetViewElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentPrintingEventArgs..::..GetViewElementIds Method
DocumentPrintingEventArgs Class See Also
---
Returns ElementIds of the views to be printed.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public IList<ElementId> GetViewElementIds()
```

Visual Basic
---
```text
Public Function GetViewElementIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetViewElementIds()
```

# ### Return Value
ElementIds of the views to be printed.
# See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace